ARMmbed/mbed-os/targets/TARGET_MICROCHIP/TARGET_PIC32CX/device/component/qspi.h
#define   QSPI_SMR_SCREN_DISABLED (0x0u << 0) /**< \brief (QSPI_SMR) The scrambling/unscrambling is disabled. */
#define   QSPI_SMR_SCREN_ENABLED (0x1u << 0) /**< \brief (QSPI_SMR) The scrambling/unscrambling is enabled. */
#define QSPI_SMR_RVDIS (0x1u << 1) /**< \brief (QSPI_SMR) Scrambling/Unscrambling Random Value Disable */
#define QSPI_SMR_SCRKL (0x1u << 2) /**< \brief (QSPI_SMR) Scrambling Key Lock */
/* -------- QSPI_SKR : (QSPI Offset: 0x44) Scrambling Key Register -------- */
#define QSPI_SKR_USRK_Pos 0
#define QSPI_SKR_USRK_Msk (0xffffffffu << QSPI_SKR_USRK_Pos) /**< \brief (QSPI_SKR) User Scrambling Key */
#define QSPI_SKR_USRK(value) ((QSPI_SKR_USRK_Msk & ((value) << QSPI_SKR_USRK_Pos)))
/* -------- QSPI_WRACNT : (QSPI Offset: 0x54) Write Access Counter Register -------- */
#define QSPI_WRACNT_NBWRA_Pos 0
#define QSPI_WRACNT_NBWRA_Msk (0xffffffffu << QSPI_WRACNT_NBWRA_Pos) /**< \brief (QSPI_WRACNT) Number of Write Accesses */
#define QSPI_WRACNT_NBWRA(value) ((QSPI_WRACNT_NBWRA_Msk & ((value) << QSPI_WRACNT_NBWRA_Pos)))
/* -------- QSPI_TOUT : (QSPI Offset: 0x64) Timeout Register -------- */
#define QSPI_TOUT_TCNTM_Pos 0
#define QSPI_TOUT_TCNTM_Msk (0xffffu << QSPI_TOUT_TCNTM_Pos) /**< \brief (QSPI_TOUT) Time-out Counter Maximum Value */
#define QSPI_TOUT_TCNTM(value) ((QSPI_TOUT_TCNTM_Msk & ((value) << QSPI_TOUT_TCNTM_Pos)))
/* -------- QSPI_WPMR : (QSPI Offset: 0xE4) Write Protection Mode Register -------- */
#define QSPI_WPMR_WPEN (0x1u << 0) /**< \brief (QSPI_WPMR) Write Protection Enable */
#define QSPI_WPMR_WPITEN (0x1u << 1) /**< \brief (QSPI_WPMR) Write Protection Interrupt Enable */
#define QSPI_WPMR_WPCREN (0x1u << 2) /**< \brief (QSPI_WPMR) Write Protection Control Register Enable */
#define QSPI_WPMR_WPKEY_Pos 8
#define QSPI_WPMR_WPKEY_Msk (0xffffffu << QSPI_WPMR_WPKEY_Pos) /**< \brief (QSPI_WPMR) Write Protection Key */
#define QSPI_WPMR_WPKEY(value) ((QSPI_WPMR_WPKEY_Msk & ((value) << QSPI_WPMR_WPKEY_Pos)))
#define   QSPI_WPMR_WPKEY_PASSWD (0x515350u << 8) /**< \brief (QSPI_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0. */
/* -------- QSPI_WPSR : (QSPI Offset: 0xE8) Write Protection Status Register -------- */
#define QSPI_WPSR_WPVS (0x1u << 0) /**< \brief (QSPI_WPSR) Write Protection Violation Status */
#define QSPI_WPSR_WPVSRC_Pos 8
#define QSPI_WPSR_WPVSRC_Msk (0xffu << QSPI_WPSR_WPVSRC_Pos) /**< \brief (QSPI_WPSR) Write Protection Violation Source */
/* -------- QSPI_RPR : (QSPI Offset: 0x100) Receive Pointer Register -------- */
#define QSPI_RPR_RXPTR_Pos 0
#define QSPI_RPR_RXPTR_Msk (0xffffffffu << QSPI_RPR_RXPTR_Pos) /**< \brief (QSPI_RPR) Receive Pointer Register */
#define QSPI_RPR_RXPTR(value) ((QSPI_RPR_RXPTR_Msk & ((value) << QSPI_RPR_RXPTR_Pos)))
/* -------- QSPI_RCR : (QSPI Offset: 0x104) Receive Counter Register -------- */
#define QSPI_RCR_RXCTR_Pos 0
#define QSPI_RCR_RXCTR_Msk (0xffffu << QSPI_RCR_RXCTR_Pos) /**< \brief (QSPI_RCR) Receive Counter Register */
#define QSPI_RCR_RXCTR(value) ((QSPI_RCR_RXCTR_Msk & ((value) << QSPI_RCR_RXCTR_Pos)))
/* -------- QSPI_TPR : (QSPI Offset: 0x108) Transmit Pointer Register -------- */
#define QSPI_TPR_TXPTR_Pos 0
#define QSPI_TPR_TXPTR_Msk (0xffffffffu << QSPI_TPR_TXPTR_Pos) /**< \brief (QSPI_TPR) Transmit Counter Register */
#define QSPI_TPR_TXPTR(value) ((QSPI_TPR_TXPTR_Msk & ((value) << QSPI_TPR_TXPTR_Pos)))
/* -------- QSPI_TCR : (QSPI Offset: 0x10C) Transmit Counter Register -------- */
#define QSPI_TCR_TXCTR_Pos 0
#define QSPI_TCR_TXCTR_Msk (0xffffu << QSPI_TCR_TXCTR_Pos) /**< \brief (QSPI_TCR) Transmit Counter Register */
#define QSPI_TCR_TXCTR(value) ((QSPI_TCR_TXCTR_Msk & ((value) << QSPI_TCR_TXCTR_Pos)))
/* -------- QSPI_RNPR : (QSPI Offset: 0x110) Receive Next Pointer Register -------- */
#define QSPI_RNPR_RXNPTR_Pos 0
#define QSPI_RNPR_RXNPTR_Msk (0xffffffffu << QSPI_RNPR_RXNPTR_Pos) /**< \brief (QSPI_RNPR) Receive Next Pointer */
#define QSPI_RNPR_RXNPTR(value) ((QSPI_RNPR_RXNPTR_Msk & ((value) << QSPI_RNPR_RXNPTR_Pos)))
/* -------- QSPI_RNCR : (QSPI Offset: 0x114) Receive Next Counter Register -------- */
#define QSPI_RNCR_RXNCTR_Pos 0
#define QSPI_RNCR_RXNCTR_Msk (0xffffu << QSPI_RNCR_RXNCTR_Pos) /**< \brief (QSPI_RNCR) Receive Next Counter */
#define QSPI_RNCR_RXNCTR(value) ((QSPI_RNCR_RXNCTR_Msk & ((value) << QSPI_RNCR_RXNCTR_Pos)))
/* -------- QSPI_TNPR : (QSPI Offset: 0x118) Transmit Next Pointer Register -------- */
#define QSPI_TNPR_TXNPTR_Pos 0
#define QSPI_TNPR_TXNPTR_Msk (0xffffffffu << QSPI_TNPR_TXNPTR_Pos) /**< \brief (QSPI_TNPR) Transmit Next Pointer */
#define QSPI_TNPR_TXNPTR(value) ((QSPI_TNPR_TXNPTR_Msk & ((value) << QSPI_TNPR_TXNPTR_Pos)))
/* -------- QSPI_TNCR : (QSPI Offset: 0x11C) Transmit Next Counter Register -------- */
#define QSPI_TNCR_TXNCTR_Pos 0
#define QSPI_TNCR_TXNCTR_Msk (0xffffu << QSPI_TNCR_TXNCTR_Pos) /**< \brief (QSPI_TNCR) Transmit Counter Next */
#define QSPI_TNCR_TXNCTR(value) ((QSPI_TNCR_TXNCTR_Msk & ((value) << QSPI_TNCR_TXNCTR_Pos)))
/* -------- QSPI_PTCR : (QSPI Offset: 0x120) Transfer Control Register -------- */
#define QSPI_PTCR_RXTEN (0x1u << 0) /**< \brief (QSPI_PTCR) Receiver Transfer Enable */
#define QSPI_PTCR_RXTDIS (0x1u << 1) /**< \brief (QSPI_PTCR) Receiver Transfer Disable */
#define QSPI_PTCR_TXTEN (0x1u << 8) /**< \brief (QSPI_PTCR) Transmitter Transfer Enable */
#define QSPI_PTCR_TXTDIS (0x1u << 9) /**< \brief (QSPI_PTCR) Transmitter Transfer Disable */
#define QSPI_PTCR_RXCBEN (0x1u << 16) /**< \brief (QSPI_PTCR) Receiver Circular Buffer Enable */
#define QSPI_PTCR_RXCBDIS (0x1u << 17) /**< \brief (QSPI_PTCR) Receiver Circular Buffer Disable */
#define QSPI_PTCR_TXCBEN (0x1u << 18) /**< \brief (QSPI_PTCR) Transmitter Circular Buffer Enable */
#define QSPI_PTCR_TXCBDIS (0x1u << 19) /**< \brief (QSPI_PTCR) Transmitter Circular Buffer Disable */
#define QSPI_PTCR_ERRCLR (0x1u << 24) /**< \brief (QSPI_PTCR) Transfer Bus Error Clear */
/* -------- QSPI_PTSR : (QSPI Offset: 0x124) Transfer Status Register -------- */
#define QSPI_PTSR_RXTEN (0x1u << 0) /**< \brief (QSPI_PTSR) Receiver Transfer Enable */
#define QSPI_PTSR_TXTEN (0x1u << 8) /**< \brief (QSPI_PTSR) Transmitter Transfer Enable */
#define QSPI_PTSR_RXCBEN (0x1u << 16) /**< \brief (QSPI_PTSR) Receiver Circular Buffer Enable */
#define QSPI_PTSR_TXCBEN (0x1u << 18) /**< \brief (QSPI_PTSR) Transmitter Circular Buffer Enable */
#define QSPI_PTSR_ERR (0x1u << 24) /**< \brief (QSPI_PTSR) Transfer Bus Error */
/* -------- QSPI_PWPMR : (QSPI Offset: 0x128) Write Protection Mode Register -------- */
#define QSPI_PWPMR_WPPTREN (0x1u << 0) /**< \brief (QSPI_PWPMR) Write Protection Pointer Registers Enable */
#define QSPI_PWPMR_WPCTREN (0x1u << 1) /**< \brief (QSPI_PWPMR) Write Protection Counter Registers Enable */
#define QSPI_PWPMR_WPCREN (0x1u << 2) /**< \brief (QSPI_PWPMR) Write Protection Control Register Enable */
#define QSPI_PWPMR_WPKEY_Pos 8
#define QSPI_PWPMR_WPKEY_Msk (0xffffffu << QSPI_PWPMR_WPKEY_Pos) /**< \brief (QSPI_PWPMR) Write Protection Key */
#define QSPI_PWPMR_WPKEY(value) ((QSPI_PWPMR_WPKEY_Msk & ((value) << QSPI_PWPMR_WPKEY_Pos)))
#define   QSPI_PWPMR_WPKEY_PASSWD (0x504443u << 8) /**< \brief (QSPI_PWPMR) Writing any other value in this field aborts the write operation. Always reads as 0. */

/*@}*/


#endif /* _PIC32CX_QSPI_COMPONENT_ */
